'''
题目：输入某年某月某日，判断这一天是这一年的第几天？

程序分析：以3月5日为例，应该先把前两个月的加起来，然后再加上5天即本年的第几天，
特殊情况，闰年且输入月份大于2时需考虑多加一天：
'''
'''
闰年计算方式
1.能被4整除而不能被100整除。

2.能被100整除也能被400整除。
'''
y = int(input('请输入年份：'))
m = int(input('请输入月份：'))
d = int(input('请输入日期：'))

months = (0,31,59,90,120,151,181,212,243,273,304,334)

if 0 < m <= 12:
    sum = months[m-1]
    #print('第%sth天'%sum)
else:
    print('输入有误')
sum += d
leap = 0
if ((y % 4)==0 and (y%100)!=0) or ((y%100)==0 and (y%400)==0):
    leap = 1
if m >2 and leap == 1:
    sum += 1
print('第%sth天'%sum)